<?php
/*
Контрольная работа: 12 минут.

1. Создайте переменную $name и присвойте ей строковое значение содержащее ваше имя
2. Создайте переменную $age и присвойте ей числовое значение содержащее ваш возраст
3. Выведите при помощи есho переменную $name
4. Выведите с помощью echo фразу “Меня зовут: ваше_имя” и “Мне ваш_возраст лет”
5. Создайте константу PROGRAM_NAME и присвойте ей значение с произвольным именем вашей программы
6. Используя цикл for вывести фразу “Привет” 5 раз
Задание 7
	$user = array(
		'first_name' => 'Владимир'
		, 'last_name' => 'Романичев'
		, 'email' => 'email@email.com'
		, 'password' => '123456'
	);
	Для него:
	1. Вывести имя
	2. Вывести почту
	3. Поменять пароль на 123

Задание 8

Создайте класс Cat, у него есть поле alias(кличка) и метод meow(мяуканье). Метод meow выводит на страницу текст “Мяу Мяу”. Конструктор класса, как аргумент принимает кличку. Создайте новый объект с из этого класса.

*/

?>