<?php
/*
Создать абстрактный класс Shape с абстрактным методом draw.
Конструктор абстрактного класса принимает на вход координаты x, y при инстанцировании устанавлиет объекту соответсвующие свойства. 
    
От него наследуются Square и Circle, в которых реализуется метод draw. 
Написать класс Picture с метод drawShape. Метод на вход принимает объект типа Shape и отрисовывает его.

1) Создать объект класса Shape. 
2) Создать объекты Square, Circle и Picture. 
3) Вызвать метод drawShape с соответствующими аргументами. 
*/
?>